In [4]:
import numpy as np
import pandas as pd
import os
os.getcwd()

'/Users/tahirabbas/Desktop/titanic'

In [2]:
os.chdir('/Users/tahirabbas/Desktop/titanic')

In [7]:
df=pd.read_csv('hola.csv')

In [8]:
df.head(4)

,Destination,Duration (days),Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,UK,7.0,35.0,Male,American,Hotel,1200,Flight,600
1,Thailand,5.0,28.0,Female,Canadian,Resort,800,Flight,500
2,Indonesia,7.0,45.0,Male,Korean,Villa,1000,Flight,700
3,USA,14.0,29.0,Female,British,Hotel,2000,Flight,1000

In [11]:
df1=df.drop(['Destination'],axis=1)
target=df['Destination']

In [12]:
df1.head(5)

,Duration (days),Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,7.0,35.0,Male,American,Hotel,1200,Flight,600
1,5.0,28.0,Female,Canadian,Resort,800,Flight,500
2,7.0,45.0,Male,Korean,Villa,1000,Flight,700
3,14.0,29.0,Female,British,Hotel,2000,Flight,1000
4,7.0,26.0,Female,Vietnamese,Airbnb,700,Train,200

In [13]:
target.head(5)

0           UK
1     Thailand
2    Indonesia
3          USA
4        Japan
Name: Destination, dtype: object

In [14]:
from sklearn.preprocessing import LabelEncoder

In [15]:
tg=LabelEncoder()
tn=LabelEncoder()
at=LabelEncoder()
tt=LabelEncoder()

In [20]:
df1['tg1']=tg.fit_transform(df1['Traveler gender'])
df1['tn1']=tn.fit_transform(df1['Traveler nationality'])
df1['at1']=at.fit_transform(df1['Accommodation type'])
df1['tt1']=tt.fit_transform(df1['Transportation type'])

In [21]:
df1.head(5)

,Duration (days),Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost,tg1,tn1,at1,tt1
0,7.0,35.0,Male,American,Hotel,1200,Flight,600,1,0,3,5
1,5.0,28.0,Female,Canadian,Resort,800,Flight,500,0,7,4,5
2,7.0,45.0,Male,Korean,Villa,1000,Flight,700,1,23,7,5
3,14.0,29.0,Female,British,Hotel,2000,Flight,1000,0,4,3,5
4,7.0,26.0,Female,Vietnamese,Airbnb,700,Train,200,0,40,0,8

In [23]:
df2=df1.drop(['Traveler gender','Traveler nationality','Accommodation type','Transportation type'],axis=1)

In [24]:
df2.head(5)

,Duration (days),Traveler age,Accommodation cost,Transportation cost,tg1,tn1,at1,tt1
0,7.0,35.0,1200,600,1,0,3,5
1,5.0,28.0,800,500,0,7,4,5
2,7.0,45.0,1000,700,1,23,7,5
3,14.0,29.0,2000,1000,0,4,3,5
4,7.0,26.0,700,200,0,40,0,8

In [28]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [37]:
df3=df2.dropna()

In [38]:
df3.head(5)

,Duration (days),Traveler age,Accommodation cost,Transportation cost,tg1,tn1,at1,tt1
0,7.0,35.0,1200,600,1,0,3,5
1,5.0,28.0,800,500,0,7,4,5
2,7.0,45.0,1000,700,1,23,7,5
3,14.0,29.0,2000,1000,0,4,3,5
4,7.0,26.0,700,200,0,40,0,8

In [39]:
df3['Total cost']=df3['Accommodation cost'].str.replace(',', '').astype(int)+df3['Transportation cost'].str.replace(',', '').astype(int)

/var/folders/nh/_xrsx9nn1f91kstthd5v77940000gn/T/ipykernel_47440/3973330127.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Total cost']=df3['Accommodation cost'].str.replace(',', '').astype(int)+df3['Transportation cost'].str.replace(',', '').astype(int)

In [40]:
df3.head(10)

,Duration (days),Traveler age,Accommodation cost,Transportation cost,tg1,tn1,at1,tt1,Total cost
0,7.0,35.0,1200,600,1,0,3,5,1800
1,5.0,28.0,800,500,0,7,4,5,1300
2,7.0,45.0,1000,700,1,23,7,5,1700
3,14.0,29.0,2000,1000,0,4,3,5,3000
4,7.0,26.0,700,200,0,40,0,8,900
5,5.0,42.0,1500,800,1,0,3,5,2300
6,10.0,33.0,500,1200,0,1,2,5,1700
7,7.0,25.0,900,600,1,3,0,5,1500
8,7.0,31.0,1200,200,0,10,3,8,1400
9,7.0,39.0,2500,800,1,11,4,5,3300

In [44]:
df4=df3.drop(['Accommodation cost','Transportation cost'],axis=1)

In [45]:
df4.head(5)

   Duration (days)  Traveler age  tg1  tn1  at1  tt1  Total cost
0              7.0          35.0    1    0    3    5        1800
1              5.0          28.0    0    7    4    5        1300
2              7.0          45.0    1   23    7    5        1700
3             14.0          29.0    0    4    3    5        3000
4              7.0          26.0    0   40    0    8         900

In [48]:
df4.dropna(inplace=True)

In [49]:
df4.head(3)

   Duration (days)  Traveler age  tg1  tn1  at1  tt1  Total cost
0              7.0          35.0    1    0    3    5        1800
1              5.0          28.0    0    7    4    5        1300
2              7.0          45.0    1   23    7    5        1700

In [53]:
df4.fillna(df.mean(), inplace=True)

/var/folders/nh/_xrsx9nn1f91kstthd5v77940000gn/T/ipykernel_47440/2366404839.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df4.fillna(df.mean(), inplace=True)

In [54]:
df4.head(4)

   Duration (days)  Traveler age  tg1  tn1  at1  tt1  Total cost
0              7.0          35.0    1    0    3    5        1800
1              5.0          28.0    0    7    4    5        1300
2              7.0          45.0    1   23    7    5        1700
3             14.0          29.0    0    4    3    5        3000

In [56]:
print(df4.isnull().sum())

Duration (days)    0
Traveler age       0
tg1                0
tn1                0
at1                0
tt1                0
Total cost         0
dtype: int64

In [58]:
print(target.isnull().sum())

2

In [61]:
target.dropna(inplace=True)

In [63]:
print(target.isnull().sum())

0

In [64]:
print(df4.isnull().sum())

Duration (days)    0
Traveler age       0
tg1                0
tn1                0
at1                0
tt1                0
Total cost         0
dtype: int64

In [66]:
print(len(df4))     
print(len(target))

136
137

In [67]:
model.fit(df4,target[:136])

DecisionTreeClassifier()

In [68]:
target1=target[:136]

In [69]:
model.score(df4,target1)

1.0

In [71]:
df4.head(4)

   Duration (days)  Traveler age  tg1  tn1  at1  tt1  Total cost
0              7.0          35.0    1    0    3    5        1800
1              5.0          28.0    0    7    4    5        1300
2              7.0          45.0    1   23    7    5        1700
3             14.0          29.0    0    4    3    5        3000

In [72]:
model.predict([[7,35,1,0,3,5,1800]])

/Users/tahirabbas/anaconda3/lib/python3.11/site-packages/sklearn/base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array(['UK'], dtype=object)

**The above algorithm predicts perfectly fine**

In [76]:
model.predict([[10,30,0,0,3,5,3000]])

/Users/tahirabbas/anaconda3/lib/python3.11/site-packages/sklearn/base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array(['USA'], dtype=object)